GopalSaraf/Practicals/PSDL/include/proc/pic18f14q40.inc
// Register: SPI1SDIPPS
#define SPI1SDIPPS SPI1SDIPPS
SPI1SDIPPS                               equ 026Bh
// bitfield definitions
SPI1SDIPPS_PIN_POSN                      equ 0000h
SPI1SDIPPS_PIN_POSITION                  equ 0000h
SPI1SDIPPS_PIN_SIZE                      equ 0003h
SPI1SDIPPS_PIN_LENGTH                    equ 0003h
SPI1SDIPPS_PIN_MASK                      equ 0007h
SPI1SDIPPS_PORT_POSN                     equ 0003h
SPI1SDIPPS_PORT_POSITION                 equ 0003h
SPI1SDIPPS_PORT_SIZE                     equ 0003h
SPI1SDIPPS_PORT_LENGTH                   equ 0003h
SPI1SDIPPS_PORT_MASK                     equ 0038h
SPI1SDIPPS_SPI1SDIPPS_POSN               equ 0000h
SPI1SDIPPS_SPI1SDIPPS_POSITION           equ 0000h
SPI1SDIPPS_SPI1SDIPPS_SIZE               equ 0006h
SPI1SDIPPS_SPI1SDIPPS_LENGTH             equ 0006h
SPI1SDIPPS_SPI1SDIPPS_MASK               equ 003Fh
SPI1SDIPPS_SPI1SDIPPS0_POSN              equ 0000h
SPI1SDIPPS_SPI1SDIPPS0_POSITION          equ 0000h
SPI1SDIPPS_SPI1SDIPPS0_SIZE              equ 0001h
SPI1SDIPPS_SPI1SDIPPS0_LENGTH            equ 0001h
SPI1SDIPPS_SPI1SDIPPS0_MASK              equ 0001h
SPI1SDIPPS_SPI1SDIPPS1_POSN              equ 0001h
SPI1SDIPPS_SPI1SDIPPS1_POSITION          equ 0001h
SPI1SDIPPS_SPI1SDIPPS1_SIZE              equ 0001h
SPI1SDIPPS_SPI1SDIPPS1_LENGTH            equ 0001h
SPI1SDIPPS_SPI1SDIPPS1_MASK              equ 0002h
SPI1SDIPPS_SPI1SDIPPS2_POSN              equ 0002h
SPI1SDIPPS_SPI1SDIPPS2_POSITION          equ 0002h
SPI1SDIPPS_SPI1SDIPPS2_SIZE              equ 0001h
SPI1SDIPPS_SPI1SDIPPS2_LENGTH            equ 0001h
SPI1SDIPPS_SPI1SDIPPS2_MASK              equ 0004h
SPI1SDIPPS_SPI1SDIPPS3_POSN              equ 0003h
SPI1SDIPPS_SPI1SDIPPS3_POSITION          equ 0003h
SPI1SDIPPS_SPI1SDIPPS3_SIZE              equ 0001h
SPI1SDIPPS_SPI1SDIPPS3_LENGTH            equ 0001h
SPI1SDIPPS_SPI1SDIPPS3_MASK              equ 0008h
SPI1SDIPPS_SPI1SDIPPS4_POSN              equ 0004h
SPI1SDIPPS_SPI1SDIPPS4_POSITION          equ 0004h
SPI1SDIPPS_SPI1SDIPPS4_SIZE              equ 0001h
SPI1SDIPPS_SPI1SDIPPS4_LENGTH            equ 0001h
SPI1SDIPPS_SPI1SDIPPS4_MASK              equ 0010h
SPI1SDIPPS_SPI1SDIPPS5_POSN              equ 0005h
SPI1SDIPPS_SPI1SDIPPS5_POSITION          equ 0005h
SPI1SDIPPS_SPI1SDIPPS5_SIZE              equ 0001h
SPI1SDIPPS_SPI1SDIPPS5_LENGTH            equ 0001h
SPI1SDIPPS_SPI1SDIPPS5_MASK              equ 0020h

// Register: SPI1SSPPS
#define SPI1SSPPS SPI1SSPPS
SPI1SSPPS                                equ 026Ch
// bitfield definitions
SPI1SSPPS_PIN_POSN                       equ 0000h
SPI1SSPPS_PIN_POSITION                   equ 0000h
SPI1SSPPS_PIN_SIZE                       equ 0003h
SPI1SSPPS_PIN_LENGTH                     equ 0003h
SPI1SSPPS_PIN_MASK                       equ 0007h
SPI1SSPPS_PORT_POSN                      equ 0003h
SPI1SSPPS_PORT_POSITION                  equ 0003h
SPI1SSPPS_PORT_SIZE                      equ 0003h
SPI1SSPPS_PORT_LENGTH                    equ 0003h
SPI1SSPPS_PORT_MASK                      equ 0038h
SPI1SSPPS_SPI1SSPPS_POSN                 equ 0000h
SPI1SSPPS_SPI1SSPPS_POSITION             equ 0000h
SPI1SSPPS_SPI1SSPPS_SIZE                 equ 0006h
SPI1SSPPS_SPI1SSPPS_LENGTH               equ 0006h
SPI1SSPPS_SPI1SSPPS_MASK                 equ 003Fh
SPI1SSPPS_SPI1SSPPS0_POSN                equ 0000h
SPI1SSPPS_SPI1SSPPS0_POSITION            equ 0000h
SPI1SSPPS_SPI1SSPPS0_SIZE                equ 0001h
SPI1SSPPS_SPI1SSPPS0_LENGTH              equ 0001h
SPI1SSPPS_SPI1SSPPS0_MASK                equ 0001h
SPI1SSPPS_SPI1SSPPS1_POSN                equ 0001h
SPI1SSPPS_SPI1SSPPS1_POSITION            equ 0001h
SPI1SSPPS_SPI1SSPPS1_SIZE                equ 0001h
SPI1SSPPS_SPI1SSPPS1_LENGTH              equ 0001h
SPI1SSPPS_SPI1SSPPS1_MASK                equ 0002h
SPI1SSPPS_SPI1SSPPS2_POSN                equ 0002h
SPI1SSPPS_SPI1SSPPS2_POSITION            equ 0002h
SPI1SSPPS_SPI1SSPPS2_SIZE                equ 0001h
SPI1SSPPS_SPI1SSPPS2_LENGTH              equ 0001h
SPI1SSPPS_SPI1SSPPS2_MASK                equ 0004h
SPI1SSPPS_SPI1SSPPS3_POSN                equ 0003h
SPI1SSPPS_SPI1SSPPS3_POSITION            equ 0003h
SPI1SSPPS_SPI1SSPPS3_SIZE                equ 0001h
SPI1SSPPS_SPI1SSPPS3_LENGTH              equ 0001h
SPI1SSPPS_SPI1SSPPS3_MASK                equ 0008h
SPI1SSPPS_SPI1SSPPS4_POSN                equ 0004h
SPI1SSPPS_SPI1SSPPS4_POSITION            equ 0004h
SPI1SSPPS_SPI1SSPPS4_SIZE                equ 0001h
SPI1SSPPS_SPI1SSPPS4_LENGTH              equ 0001h
SPI1SSPPS_SPI1SSPPS4_MASK                equ 0010h
SPI1SSPPS_SPI1SSPPS5_POSN                equ 0005h
SPI1SSPPS_SPI1SSPPS5_POSITION            equ 0005h
SPI1SSPPS_SPI1SSPPS5_SIZE                equ 0001h
SPI1SSPPS_SPI1SSPPS5_LENGTH              equ 0001h
SPI1SSPPS_SPI1SSPPS5_MASK                equ 0020h

// Register: SPI2SCKPPS
#define SPI2SCKPPS SPI2SCKPPS
SPI2SCKPPS                               equ 026Dh
// bitfield definitions
SPI2SCKPPS_PIN_POSN                      equ 0000h
SPI2SCKPPS_PIN_POSITION                  equ 0000h
SPI2SCKPPS_PIN_SIZE                      equ 0003h
SPI2SCKPPS_PIN_LENGTH                    equ 0003h
SPI2SCKPPS_PIN_MASK                      equ 0007h
SPI2SCKPPS_PORT_POSN                     equ 0003h
SPI2SCKPPS_PORT_POSITION                 equ 0003h
SPI2SCKPPS_PORT_SIZE                     equ 0003h
SPI2SCKPPS_PORT_LENGTH                   equ 0003h
SPI2SCKPPS_PORT_MASK                     equ 0038h
SPI2SCKPPS_SPI2SCKPPS_POSN               equ 0000h
SPI2SCKPPS_SPI2SCKPPS_POSITION           equ 0000h
SPI2SCKPPS_SPI2SCKPPS_SIZE               equ 0006h
SPI2SCKPPS_SPI2SCKPPS_LENGTH             equ 0006h
SPI2SCKPPS_SPI2SCKPPS_MASK               equ 003Fh
SPI2SCKPPS_SPI2SCKPPS0_POSN              equ 0000h
SPI2SCKPPS_SPI2SCKPPS0_POSITION          equ 0000h
SPI2SCKPPS_SPI2SCKPPS0_SIZE              equ 0001h
SPI2SCKPPS_SPI2SCKPPS0_LENGTH            equ 0001h
SPI2SCKPPS_SPI2SCKPPS0_MASK              equ 0001h
SPI2SCKPPS_SPI2SCKPPS1_POSN              equ 0001h
SPI2SCKPPS_SPI2SCKPPS1_POSITION          equ 0001h
SPI2SCKPPS_SPI2SCKPPS1_SIZE              equ 0001h
SPI2SCKPPS_SPI2SCKPPS1_LENGTH            equ 0001h
SPI2SCKPPS_SPI2SCKPPS1_MASK              equ 0002h
SPI2SCKPPS_SPI2SCKPPS2_POSN              equ 0002h
SPI2SCKPPS_SPI2SCKPPS2_POSITION          equ 0002h
SPI2SCKPPS_SPI2SCKPPS2_SIZE              equ 0001h
SPI2SCKPPS_SPI2SCKPPS2_LENGTH            equ 0001h
SPI2SCKPPS_SPI2SCKPPS2_MASK              equ 0004h
SPI2SCKPPS_SPI2SCKPPS3_POSN              equ 0003h
SPI2SCKPPS_SPI2SCKPPS3_POSITION          equ 0003h
SPI2SCKPPS_SPI2SCKPPS3_SIZE              equ 0001h
SPI2SCKPPS_SPI2SCKPPS3_LENGTH            equ 0001h
SPI2SCKPPS_SPI2SCKPPS3_MASK              equ 0008h
SPI2SCKPPS_SPI2SCKPPS4_POSN              equ 0004h
SPI2SCKPPS_SPI2SCKPPS4_POSITION          equ 0004h
SPI2SCKPPS_SPI2SCKPPS4_SIZE              equ 0001h
SPI2SCKPPS_SPI2SCKPPS4_LENGTH            equ 0001h
SPI2SCKPPS_SPI2SCKPPS4_MASK              equ 0010h
SPI2SCKPPS_SPI2SCKPPS5_POSN              equ 0005h
SPI2SCKPPS_SPI2SCKPPS5_POSITION          equ 0005h
SPI2SCKPPS_SPI2SCKPPS5_SIZE              equ 0001h
SPI2SCKPPS_SPI2SCKPPS5_LENGTH            equ 0001h
SPI2SCKPPS_SPI2SCKPPS5_MASK              equ 0020h

// Register: SPI2SDIPPS
#define SPI2SDIPPS SPI2SDIPPS
SPI2SDIPPS                               equ 026Eh
// bitfield definitions
SPI2SDIPPS_PIN_POSN                      equ 0000h
SPI2SDIPPS_PIN_POSITION                  equ 0000h
SPI2SDIPPS_PIN_SIZE                      equ 0003h
SPI2SDIPPS_PIN_LENGTH                    equ 0003h
SPI2SDIPPS_PIN_MASK                      equ 0007h
SPI2SDIPPS_PORT_POSN                     equ 0003h
SPI2SDIPPS_PORT_POSITION                 equ 0003h
SPI2SDIPPS_PORT_SIZE                     equ 0003h
SPI2SDIPPS_PORT_LENGTH                   equ 0003h
SPI2SDIPPS_PORT_MASK                     equ 0038h
SPI2SDIPPS_SPI2SDIPPS_POSN               equ 0000h
SPI2SDIPPS_SPI2SDIPPS_POSITION           equ 0000h
SPI2SDIPPS_SPI2SDIPPS_SIZE               equ 0006h
SPI2SDIPPS_SPI2SDIPPS_LENGTH             equ 0006h
SPI2SDIPPS_SPI2SDIPPS_MASK               equ 003Fh
SPI2SDIPPS_SPI2SDIPPS0_POSN              equ 0000h
SPI2SDIPPS_SPI2SDIPPS0_POSITION          equ 0000h
SPI2SDIPPS_SPI2SDIPPS0_SIZE              equ 0001h
SPI2SDIPPS_SPI2SDIPPS0_LENGTH            equ 0001h
SPI2SDIPPS_SPI2SDIPPS0_MASK              equ 0001h
SPI2SDIPPS_SPI2SDIPPS1_POSN              equ 0001h
SPI2SDIPPS_SPI2SDIPPS1_POSITION          equ 0001h
SPI2SDIPPS_SPI2SDIPPS1_SIZE              equ 0001h
SPI2SDIPPS_SPI2SDIPPS1_LENGTH            equ 0001h
SPI2SDIPPS_SPI2SDIPPS1_MASK              equ 0002h
SPI2SDIPPS_SPI2SDIPPS2_POSN              equ 0002h
SPI2SDIPPS_SPI2SDIPPS2_POSITION          equ 0002h
SPI2SDIPPS_SPI2SDIPPS2_SIZE              equ 0001h
SPI2SDIPPS_SPI2SDIPPS2_LENGTH            equ 0001h
SPI2SDIPPS_SPI2SDIPPS2_MASK              equ 0004h
SPI2SDIPPS_SPI2SDIPPS3_POSN              equ 0003h
SPI2SDIPPS_SPI2SDIPPS3_POSITION          equ 0003h
SPI2SDIPPS_SPI2SDIPPS3_SIZE              equ 0001h
SPI2SDIPPS_SPI2SDIPPS3_LENGTH            equ 0001h
SPI2SDIPPS_SPI2SDIPPS3_MASK              equ 0008h
SPI2SDIPPS_SPI2SDIPPS4_POSN              equ 0004h
SPI2SDIPPS_SPI2SDIPPS4_POSITION          equ 0004h
SPI2SDIPPS_SPI2SDIPPS4_SIZE              equ 0001h
SPI2SDIPPS_SPI2SDIPPS4_LENGTH            equ 0001h
SPI2SDIPPS_SPI2SDIPPS4_MASK              equ 0010h
SPI2SDIPPS_SPI2SDIPPS5_POSN              equ 0005h
SPI2SDIPPS_SPI2SDIPPS5_POSITION          equ 0005h
SPI2SDIPPS_SPI2SDIPPS5_SIZE              equ 0001h
SPI2SDIPPS_SPI2SDIPPS5_LENGTH            equ 0001h
SPI2SDIPPS_SPI2SDIPPS5_MASK              equ 0020h

// Register: SPI2SSPPS
#define SPI2SSPPS SPI2SSPPS
SPI2SSPPS                                equ 026Fh
// bitfield definitions
SPI2SSPPS_PIN_POSN                       equ 0000h
SPI2SSPPS_PIN_POSITION                   equ 0000h
SPI2SSPPS_PIN_SIZE                       equ 0003h
SPI2SSPPS_PIN_LENGTH                     equ 0003h
SPI2SSPPS_PIN_MASK                       equ 0007h
SPI2SSPPS_PORT_POSN                      equ 0003h
SPI2SSPPS_PORT_POSITION                  equ 0003h
SPI2SSPPS_PORT_SIZE                      equ 0003h
SPI2SSPPS_PORT_LENGTH                    equ 0003h
SPI2SSPPS_PORT_MASK                      equ 0038h
SPI2SSPPS_SPI2SSPPS_POSN                 equ 0000h
SPI2SSPPS_SPI2SSPPS_POSITION             equ 0000h
SPI2SSPPS_SPI2SSPPS_SIZE                 equ 0006h
SPI2SSPPS_SPI2SSPPS_LENGTH               equ 0006h
SPI2SSPPS_SPI2SSPPS_MASK                 equ 003Fh
SPI2SSPPS_SPI2SSPPS0_POSN                equ 0000h
SPI2SSPPS_SPI2SSPPS0_POSITION            equ 0000h
SPI2SSPPS_SPI2SSPPS0_SIZE                equ 0001h
SPI2SSPPS_SPI2SSPPS0_LENGTH              equ 0001h
SPI2SSPPS_SPI2SSPPS0_MASK                equ 0001h
SPI2SSPPS_SPI2SSPPS1_POSN                equ 0001h
SPI2SSPPS_SPI2SSPPS1_POSITION            equ 0001h
SPI2SSPPS_SPI2SSPPS1_SIZE                equ 0001h
SPI2SSPPS_SPI2SSPPS1_LENGTH              equ 0001h
SPI2SSPPS_SPI2SSPPS1_MASK                equ 0002h
SPI2SSPPS_SPI2SSPPS2_POSN                equ 0002h
SPI2SSPPS_SPI2SSPPS2_POSITION            equ 0002h
SPI2SSPPS_SPI2SSPPS2_SIZE                equ 0001h
SPI2SSPPS_SPI2SSPPS2_LENGTH              equ 0001h
SPI2SSPPS_SPI2SSPPS2_MASK                equ 0004h
SPI2SSPPS_SPI2SSPPS3_POSN                equ 0003h
SPI2SSPPS_SPI2SSPPS3_POSITION            equ 0003h
SPI2SSPPS_SPI2SSPPS3_SIZE                equ 0001h
SPI2SSPPS_SPI2SSPPS3_LENGTH              equ 0001h
SPI2SSPPS_SPI2SSPPS3_MASK                equ 0008h
SPI2SSPPS_SPI2SSPPS4_POSN                equ 0004h
SPI2SSPPS_SPI2SSPPS4_POSITION            equ 0004h
SPI2SSPPS_SPI2SSPPS4_SIZE                equ 0001h
SPI2SSPPS_SPI2SSPPS4_LENGTH              equ 0001h
SPI2SSPPS_SPI2SSPPS4_MASK                equ 0010h
SPI2SSPPS_SPI2SSPPS5_POSN                equ 0005h
SPI2SSPPS_SPI2SSPPS5_POSITION            equ 0005h
SPI2SSPPS_SPI2SSPPS5_SIZE                equ 0001h
SPI2SSPPS_SPI2SSPPS5_LENGTH              equ 0001h
SPI2SSPPS_SPI2SSPPS5_MASK                equ 0020h

