GopalSaraf/Practicals/PSDL/include/proc/pic18f14q40.inc
// Register: U3P3L
#define U3P3L U3P3L
U3P3L                                    equ 02CFh
// bitfield definitions
U3P3L_P3L_POSN                           equ 0000h
U3P3L_P3L_POSITION                       equ 0000h
U3P3L_P3L_SIZE                           equ 0008h
U3P3L_P3L_LENGTH                         equ 0008h
U3P3L_P3L_MASK                           equ 00FFh

// Register: U3CON0
#define U3CON0 U3CON0
U3CON0                                   equ 02D1h
// bitfield definitions
U3CON0_MODE0_POSN                        equ 0000h
U3CON0_MODE0_POSITION                    equ 0000h
U3CON0_MODE0_SIZE                        equ 0001h
U3CON0_MODE0_LENGTH                      equ 0001h
U3CON0_MODE0_MASK                        equ 0001h
U3CON0_MODE1_POSN                        equ 0001h
U3CON0_MODE1_POSITION                    equ 0001h
U3CON0_MODE1_SIZE                        equ 0001h
U3CON0_MODE1_LENGTH                      equ 0001h
U3CON0_MODE1_MASK                        equ 0002h
U3CON0_MODE2_POSN                        equ 0002h
U3CON0_MODE2_POSITION                    equ 0002h
U3CON0_MODE2_SIZE                        equ 0001h
U3CON0_MODE2_LENGTH                      equ 0001h
U3CON0_MODE2_MASK                        equ 0004h
U3CON0_U3MODE_POSN                       equ 0000h
U3CON0_U3MODE_POSITION                   equ 0000h
U3CON0_U3MODE_SIZE                       equ 0004h
U3CON0_U3MODE_LENGTH                     equ 0004h
U3CON0_U3MODE_MASK                       equ 000Fh
U3CON0_U3RXEN_POSN                       equ 0004h
U3CON0_U3RXEN_POSITION                   equ 0004h
U3CON0_U3RXEN_SIZE                       equ 0001h
U3CON0_U3RXEN_LENGTH                     equ 0001h
U3CON0_U3RXEN_MASK                       equ 0010h
U3CON0_U3TXEN_POSN                       equ 0005h
U3CON0_U3TXEN_POSITION                   equ 0005h
U3CON0_U3TXEN_SIZE                       equ 0001h
U3CON0_U3TXEN_LENGTH                     equ 0001h
U3CON0_U3TXEN_MASK                       equ 0020h
U3CON0_U3ABDEN_POSN                      equ 0006h
U3CON0_U3ABDEN_POSITION                  equ 0006h
U3CON0_U3ABDEN_SIZE                      equ 0001h
U3CON0_U3ABDEN_LENGTH                    equ 0001h
U3CON0_U3ABDEN_MASK                      equ 0040h
U3CON0_U3BRGS_POSN                       equ 0007h
U3CON0_U3BRGS_POSITION                   equ 0007h
U3CON0_U3BRGS_SIZE                       equ 0001h
U3CON0_U3BRGS_LENGTH                     equ 0001h
U3CON0_U3BRGS_MASK                       equ 0080h
U3CON0_U3MODE0_POSN                      equ 0000h
U3CON0_U3MODE0_POSITION                  equ 0000h
U3CON0_U3MODE0_SIZE                      equ 0001h
U3CON0_U3MODE0_LENGTH                    equ 0001h
U3CON0_U3MODE0_MASK                      equ 0001h
U3CON0_U3MODE1_POSN                      equ 0001h
U3CON0_U3MODE1_POSITION                  equ 0001h
U3CON0_U3MODE1_SIZE                      equ 0001h
U3CON0_U3MODE1_LENGTH                    equ 0001h
U3CON0_U3MODE1_MASK                      equ 0002h
U3CON0_U3MODE2_POSN                      equ 0002h
U3CON0_U3MODE2_POSITION                  equ 0002h
U3CON0_U3MODE2_SIZE                      equ 0001h
U3CON0_U3MODE2_LENGTH                    equ 0001h
U3CON0_U3MODE2_MASK                      equ 0004h
U3CON0_MODE_POSN                         equ 0000h
U3CON0_MODE_POSITION                     equ 0000h
U3CON0_MODE_SIZE                         equ 0004h
U3CON0_MODE_LENGTH                       equ 0004h
U3CON0_MODE_MASK                         equ 000Fh
U3CON0_RXEN_POSN                         equ 0004h
U3CON0_RXEN_POSITION                     equ 0004h
U3CON0_RXEN_SIZE                         equ 0001h
U3CON0_RXEN_LENGTH                       equ 0001h
U3CON0_RXEN_MASK                         equ 0010h
U3CON0_TXEN_POSN                         equ 0005h
U3CON0_TXEN_POSITION                     equ 0005h
U3CON0_TXEN_SIZE                         equ 0001h
U3CON0_TXEN_LENGTH                       equ 0001h
U3CON0_TXEN_MASK                         equ 0020h
U3CON0_ABDEN_POSN                        equ 0006h
U3CON0_ABDEN_POSITION                    equ 0006h
U3CON0_ABDEN_SIZE                        equ 0001h
U3CON0_ABDEN_LENGTH                      equ 0001h
U3CON0_ABDEN_MASK                        equ 0040h
U3CON0_BRGS_POSN                         equ 0007h
U3CON0_BRGS_POSITION                     equ 0007h
U3CON0_BRGS_SIZE                         equ 0001h
U3CON0_BRGS_LENGTH                       equ 0001h
U3CON0_BRGS_MASK                         equ 0080h

// Register: U3CON1
#define U3CON1 U3CON1
U3CON1                                   equ 02D2h
// bitfield definitions
U3CON1_SENDB_POSN                        equ 0000h
U3CON1_SENDB_POSITION                    equ 0000h
U3CON1_SENDB_SIZE                        equ 0001h
U3CON1_SENDB_LENGTH                      equ 0001h
U3CON1_SENDB_MASK                        equ 0001h
U3CON1_BRKOVR_POSN                       equ 0001h
U3CON1_BRKOVR_POSITION                   equ 0001h
U3CON1_BRKOVR_SIZE                       equ 0001h
U3CON1_BRKOVR_LENGTH                     equ 0001h
U3CON1_BRKOVR_MASK                       equ 0002h
U3CON1_RXBIMD_POSN                       equ 0003h
U3CON1_RXBIMD_POSITION                   equ 0003h
U3CON1_RXBIMD_SIZE                       equ 0001h
U3CON1_RXBIMD_LENGTH                     equ 0001h
U3CON1_RXBIMD_MASK                       equ 0008h
U3CON1_WUE_POSN                          equ 0004h
U3CON1_WUE_POSITION                      equ 0004h
U3CON1_WUE_SIZE                          equ 0001h
U3CON1_WUE_LENGTH                        equ 0001h
U3CON1_WUE_MASK                          equ 0010h
U3CON1_ON_POSN                           equ 0007h
U3CON1_ON_POSITION                       equ 0007h
U3CON1_ON_SIZE                           equ 0001h
U3CON1_ON_LENGTH                         equ 0001h
U3CON1_ON_MASK                           equ 0080h
U3CON1_U3SENDB_POSN                      equ 0000h
U3CON1_U3SENDB_POSITION                  equ 0000h
U3CON1_U3SENDB_SIZE                      equ 0001h
U3CON1_U3SENDB_LENGTH                    equ 0001h
U3CON1_U3SENDB_MASK                      equ 0001h
U3CON1_U3BRKOVR_POSN                     equ 0001h
U3CON1_U3BRKOVR_POSITION                 equ 0001h
U3CON1_U3BRKOVR_SIZE                     equ 0001h
U3CON1_U3BRKOVR_LENGTH                   equ 0001h
U3CON1_U3BRKOVR_MASK                     equ 0002h
U3CON1_U3RXBIMD_POSN                     equ 0003h
U3CON1_U3RXBIMD_POSITION                 equ 0003h
U3CON1_U3RXBIMD_SIZE                     equ 0001h
U3CON1_U3RXBIMD_LENGTH                   equ 0001h
U3CON1_U3RXBIMD_MASK                     equ 0008h
U3CON1_U3WUE_POSN                        equ 0004h
U3CON1_U3WUE_POSITION                    equ 0004h
U3CON1_U3WUE_SIZE                        equ 0001h
U3CON1_U3WUE_LENGTH                      equ 0001h
U3CON1_U3WUE_MASK                        equ 0010h
U3CON1_U3ON_POSN                         equ 0007h
U3CON1_U3ON_POSITION                     equ 0007h
U3CON1_U3ON_SIZE                         equ 0001h
U3CON1_U3ON_LENGTH                       equ 0001h
U3CON1_U3ON_MASK                         equ 0080h

// Register: U3CON2
#define U3CON2 U3CON2
U3CON2                                   equ 02D3h
// bitfield definitions
U3CON2_FLO_POSN                          equ 0000h
U3CON2_FLO_POSITION                      equ 0000h
U3CON2_FLO_SIZE                          equ 0002h
U3CON2_FLO_LENGTH                        equ 0002h
U3CON2_FLO_MASK                          equ 0003h
U3CON2_TXPOL_POSN                        equ 0002h
U3CON2_TXPOL_POSITION                    equ 0002h
U3CON2_TXPOL_SIZE                        equ 0001h
U3CON2_TXPOL_LENGTH                      equ 0001h
U3CON2_TXPOL_MASK                        equ 0004h
U3CON2_STP_POSN                          equ 0004h
U3CON2_STP_POSITION                      equ 0004h
U3CON2_STP_SIZE                          equ 0002h
U3CON2_STP_LENGTH                        equ 0002h
U3CON2_STP_MASK                          equ 0030h
U3CON2_RXPOL_POSN                        equ 0006h
U3CON2_RXPOL_POSITION                    equ 0006h
U3CON2_RXPOL_SIZE                        equ 0001h
U3CON2_RXPOL_LENGTH                      equ 0001h
U3CON2_RXPOL_MASK                        equ 0040h
U3CON2_RUNOVF_POSN                       equ 0007h
U3CON2_RUNOVF_POSITION                   equ 0007h
U3CON2_RUNOVF_SIZE                       equ 0001h
U3CON2_RUNOVF_LENGTH                     equ 0001h
U3CON2_RUNOVF_MASK                       equ 0080h
U3CON2_FLO0_POSN                         equ 0000h
U3CON2_FLO0_POSITION                     equ 0000h
U3CON2_FLO0_SIZE                         equ 0001h
U3CON2_FLO0_LENGTH                       equ 0001h
U3CON2_FLO0_MASK                         equ 0001h
U3CON2_FLO1_POSN                         equ 0001h
U3CON2_FLO1_POSITION                     equ 0001h
U3CON2_FLO1_SIZE                         equ 0001h
U3CON2_FLO1_LENGTH                       equ 0001h
U3CON2_FLO1_MASK                         equ 0002h
U3CON2_STP0_POSN                         equ 0004h
U3CON2_STP0_POSITION                     equ 0004h
U3CON2_STP0_SIZE                         equ 0001h
U3CON2_STP0_LENGTH                       equ 0001h
U3CON2_STP0_MASK                         equ 0010h
U3CON2_STP1_POSN                         equ 0005h
U3CON2_STP1_POSITION                     equ 0005h
U3CON2_STP1_SIZE                         equ 0001h
U3CON2_STP1_LENGTH                       equ 0001h
U3CON2_STP1_MASK                         equ 0020h
U3CON2_U3FLO_POSN                        equ 0000h
U3CON2_U3FLO_POSITION                    equ 0000h
U3CON2_U3FLO_SIZE                        equ 0002h
U3CON2_U3FLO_LENGTH                      equ 0002h
U3CON2_U3FLO_MASK                        equ 0003h
U3CON2_U3TXPOL_POSN                      equ 0002h
U3CON2_U3TXPOL_POSITION                  equ 0002h
U3CON2_U3TXPOL_SIZE                      equ 0001h
U3CON2_U3TXPOL_LENGTH                    equ 0001h
U3CON2_U3TXPOL_MASK                      equ 0004h
U3CON2_U3STP_POSN                        equ 0004h
U3CON2_U3STP_POSITION                    equ 0004h
U3CON2_U3STP_SIZE                        equ 0002h
U3CON2_U3STP_LENGTH                      equ 0002h
U3CON2_U3STP_MASK                        equ 0030h
U3CON2_U3RXPOL_POSN                      equ 0006h
U3CON2_U3RXPOL_POSITION                  equ 0006h
U3CON2_U3RXPOL_SIZE                      equ 0001h
U3CON2_U3RXPOL_LENGTH                    equ 0001h
U3CON2_U3RXPOL_MASK                      equ 0040h
U3CON2_U3RUNOVF_POSN                     equ 0007h
U3CON2_U3RUNOVF_POSITION                 equ 0007h
U3CON2_U3RUNOVF_SIZE                     equ 0001h
U3CON2_U3RUNOVF_LENGTH                   equ 0001h
U3CON2_U3RUNOVF_MASK                     equ 0080h
U3CON2_U3FLO0_POSN                       equ 0000h
U3CON2_U3FLO0_POSITION                   equ 0000h
U3CON2_U3FLO0_SIZE                       equ 0001h
U3CON2_U3FLO0_LENGTH                     equ 0001h
U3CON2_U3FLO0_MASK                       equ 0001h
U3CON2_U3FLO1_POSN                       equ 0001h
U3CON2_U3FLO1_POSITION                   equ 0001h
U3CON2_U3FLO1_SIZE                       equ 0001h
U3CON2_U3FLO1_LENGTH                     equ 0001h
U3CON2_U3FLO1_MASK                       equ 0002h
U3CON2_U3STP0_POSN                       equ 0004h
U3CON2_U3STP0_POSITION                   equ 0004h
U3CON2_U3STP0_SIZE                       equ 0001h
U3CON2_U3STP0_LENGTH                     equ 0001h
U3CON2_U3STP0_MASK                       equ 0010h
U3CON2_U3STP1_POSN                       equ 0005h
U3CON2_U3STP1_POSITION                   equ 0005h
U3CON2_U3STP1_SIZE                       equ 0001h
U3CON2_U3STP1_LENGTH                     equ 0001h
U3CON2_U3STP1_MASK                       equ 0020h

