GopalSaraf/Practicals/PSDL/include/proc/pic18f14q40.inc
// Register: PWM1GIE
#define PWM1GIE PWM1GIE
PWM1GIE                                  equ 0468h
// bitfield definitions
PWM1GIE_S1P1IE_POSN                      equ 0000h
PWM1GIE_S1P1IE_POSITION                  equ 0000h
PWM1GIE_S1P1IE_SIZE                      equ 0001h
PWM1GIE_S1P1IE_LENGTH                    equ 0001h
PWM1GIE_S1P1IE_MASK                      equ 0001h
PWM1GIE_S1P2IE_POSN                      equ 0001h
PWM1GIE_S1P2IE_POSITION                  equ 0001h
PWM1GIE_S1P2IE_SIZE                      equ 0001h
PWM1GIE_S1P2IE_LENGTH                    equ 0001h
PWM1GIE_S1P2IE_MASK                      equ 0002h

// Register: PWM1CON
#define PWM1CON PWM1CON
PWM1CON                                  equ 0469h
// bitfield definitions
PWM1CON_ERSNOW_POSN                      equ 0000h
PWM1CON_ERSNOW_POSITION                  equ 0000h
PWM1CON_ERSNOW_SIZE                      equ 0001h
PWM1CON_ERSNOW_LENGTH                    equ 0001h
PWM1CON_ERSNOW_MASK                      equ 0001h
PWM1CON_ERSPOL_POSN                      equ 0001h
PWM1CON_ERSPOL_POSITION                  equ 0001h
PWM1CON_ERSPOL_SIZE                      equ 0001h
PWM1CON_ERSPOL_LENGTH                    equ 0001h
PWM1CON_ERSPOL_MASK                      equ 0002h
PWM1CON_LD_POSN                          equ 0002h
PWM1CON_LD_POSITION                      equ 0002h
PWM1CON_LD_SIZE                          equ 0001h
PWM1CON_LD_LENGTH                        equ 0001h
PWM1CON_LD_MASK                          equ 0004h
PWM1CON_EN_POSN                          equ 0007h
PWM1CON_EN_POSITION                      equ 0007h
PWM1CON_EN_SIZE                          equ 0001h
PWM1CON_EN_LENGTH                        equ 0001h
PWM1CON_EN_MASK                          equ 0080h

// Register: PWM1S1CFG
#define PWM1S1CFG PWM1S1CFG
PWM1S1CFG                                equ 046Ah
// bitfield definitions
PWM1S1CFG_MODE_POSN                      equ 0000h
PWM1S1CFG_MODE_POSITION                  equ 0000h
PWM1S1CFG_MODE_SIZE                      equ 0003h
PWM1S1CFG_MODE_LENGTH                    equ 0003h
PWM1S1CFG_MODE_MASK                      equ 0007h
PWM1S1CFG_PPEN_POSN                      equ 0003h
PWM1S1CFG_PPEN_POSITION                  equ 0003h
PWM1S1CFG_PPEN_SIZE                      equ 0001h
PWM1S1CFG_PPEN_LENGTH                    equ 0001h
PWM1S1CFG_PPEN_MASK                      equ 0008h
PWM1S1CFG_POL1_POSN                      equ 0006h
PWM1S1CFG_POL1_POSITION                  equ 0006h
PWM1S1CFG_POL1_SIZE                      equ 0001h
PWM1S1CFG_POL1_LENGTH                    equ 0001h
PWM1S1CFG_POL1_MASK                      equ 0040h
PWM1S1CFG_POL2_POSN                      equ 0007h
PWM1S1CFG_POL2_POSITION                  equ 0007h
PWM1S1CFG_POL2_SIZE                      equ 0001h
PWM1S1CFG_POL2_LENGTH                    equ 0001h
PWM1S1CFG_POL2_MASK                      equ 0080h
PWM1S1CFG_MODE0_POSN                     equ 0000h
PWM1S1CFG_MODE0_POSITION                 equ 0000h
PWM1S1CFG_MODE0_SIZE                     equ 0001h
PWM1S1CFG_MODE0_LENGTH                   equ 0001h
PWM1S1CFG_MODE0_MASK                     equ 0001h
PWM1S1CFG_MODE1_POSN                     equ 0001h
PWM1S1CFG_MODE1_POSITION                 equ 0001h
PWM1S1CFG_MODE1_SIZE                     equ 0001h
PWM1S1CFG_MODE1_LENGTH                   equ 0001h
PWM1S1CFG_MODE1_MASK                     equ 0002h
PWM1S1CFG_MODE2_POSN                     equ 0002h
PWM1S1CFG_MODE2_POSITION                 equ 0002h
PWM1S1CFG_MODE2_SIZE                     equ 0001h
PWM1S1CFG_MODE2_LENGTH                   equ 0001h
PWM1S1CFG_MODE2_MASK                     equ 0004h

// Register: PWM1S1P1
#define PWM1S1P1 PWM1S1P1
PWM1S1P1                                 equ 046Bh

// Register: PWM1S1P1L
#define PWM1S1P1L PWM1S1P1L
PWM1S1P1L                                equ 046Bh
// bitfield definitions
PWM1S1P1L_S1P1L_POSN                     equ 0000h
PWM1S1P1L_S1P1L_POSITION                 equ 0000h
PWM1S1P1L_S1P1L_SIZE                     equ 0008h
PWM1S1P1L_S1P1L_LENGTH                   equ 0008h
PWM1S1P1L_S1P1L_MASK                     equ 00FFh

// Register: PWM1S1P1H
#define PWM1S1P1H PWM1S1P1H
PWM1S1P1H                                equ 046Ch
// bitfield definitions
PWM1S1P1H_S1P1H_POSN                     equ 0000h
PWM1S1P1H_S1P1H_POSITION                 equ 0000h
PWM1S1P1H_S1P1H_SIZE                     equ 0008h
PWM1S1P1H_S1P1H_LENGTH                   equ 0008h
PWM1S1P1H_S1P1H_MASK                     equ 00FFh

// Register: PWM1S1P2
#define PWM1S1P2 PWM1S1P2
PWM1S1P2                                 equ 046Dh

// Register: PWM1S1P2L
#define PWM1S1P2L PWM1S1P2L
PWM1S1P2L                                equ 046Dh
// bitfield definitions
PWM1S1P2L_S1P2L_POSN                     equ 0000h
PWM1S1P2L_S1P2L_POSITION                 equ 0000h
PWM1S1P2L_S1P2L_SIZE                     equ 0008h
PWM1S1P2L_S1P2L_LENGTH                   equ 0008h
PWM1S1P2L_S1P2L_MASK                     equ 00FFh

// Register: PWM1S1P2H
#define PWM1S1P2H PWM1S1P2H
PWM1S1P2H                                equ 046Eh
// bitfield definitions
PWM1S1P2H_S1P2H_POSN                     equ 0000h
PWM1S1P2H_S1P2H_POSITION                 equ 0000h
PWM1S1P2H_S1P2H_SIZE                     equ 0008h
PWM1S1P2H_S1P2H_LENGTH                   equ 0008h
PWM1S1P2H_S1P2H_MASK                     equ 00FFh

// Register: PWM2ERS
#define PWM2ERS PWM2ERS
PWM2ERS                                  equ 046Fh
// bitfield definitions
PWM2ERS_ERS_POSN                         equ 0000h
PWM2ERS_ERS_POSITION                     equ 0000h
PWM2ERS_ERS_SIZE                         equ 0008h
PWM2ERS_ERS_LENGTH                       equ 0008h
PWM2ERS_ERS_MASK                         equ 00FFh
PWM2ERS_ERS0_POSN                        equ 0000h
PWM2ERS_ERS0_POSITION                    equ 0000h
PWM2ERS_ERS0_SIZE                        equ 0001h
PWM2ERS_ERS0_LENGTH                      equ 0001h
PWM2ERS_ERS0_MASK                        equ 0001h
PWM2ERS_ERS1_POSN                        equ 0001h
PWM2ERS_ERS1_POSITION                    equ 0001h
PWM2ERS_ERS1_SIZE                        equ 0001h
PWM2ERS_ERS1_LENGTH                      equ 0001h
PWM2ERS_ERS1_MASK                        equ 0002h
PWM2ERS_ERS2_POSN                        equ 0002h
PWM2ERS_ERS2_POSITION                    equ 0002h
PWM2ERS_ERS2_SIZE                        equ 0001h
PWM2ERS_ERS2_LENGTH                      equ 0001h
PWM2ERS_ERS2_MASK                        equ 0004h
PWM2ERS_ERS3_POSN                        equ 0003h
PWM2ERS_ERS3_POSITION                    equ 0003h
PWM2ERS_ERS3_SIZE                        equ 0001h
PWM2ERS_ERS3_LENGTH                      equ 0001h
PWM2ERS_ERS3_MASK                        equ 0008h
PWM2ERS_ERS4_POSN                        equ 0004h
PWM2ERS_ERS4_POSITION                    equ 0004h
PWM2ERS_ERS4_SIZE                        equ 0001h
PWM2ERS_ERS4_LENGTH                      equ 0001h
PWM2ERS_ERS4_MASK                        equ 0010h
PWM2ERS_ERS5_POSN                        equ 0005h
PWM2ERS_ERS5_POSITION                    equ 0005h
PWM2ERS_ERS5_SIZE                        equ 0001h
PWM2ERS_ERS5_LENGTH                      equ 0001h
PWM2ERS_ERS5_MASK                        equ 0020h
PWM2ERS_ERS6_POSN                        equ 0006h
PWM2ERS_ERS6_POSITION                    equ 0006h
PWM2ERS_ERS6_SIZE                        equ 0001h
PWM2ERS_ERS6_LENGTH                      equ 0001h
PWM2ERS_ERS6_MASK                        equ 0040h
PWM2ERS_ERS7_POSN                        equ 0007h
PWM2ERS_ERS7_POSITION                    equ 0007h
PWM2ERS_ERS7_SIZE                        equ 0001h
PWM2ERS_ERS7_LENGTH                      equ 0001h
PWM2ERS_ERS7_MASK                        equ 0080h

